{
    "isSuccess": true,
    "data": {
        "post": "Lead Clinical Pharmacist Paediatrics",
        "company": "HCA Healthcare UK",
        "salary": "Competitive salary",
        "posted": "3 days ago",
        "location": "London, South East England",
        "type": "Permanent,full-time",
        "reference": "51204363",
        "description": "Lead Clinical Pharmacist (Paediatrics)Location: The Portland HospitalHours: Full time 37.5 hours per week Salary: Competitive + Benefits + Excellent Training and Development The Portland Hospital is the only private hospital in the UK dedicated to the healthcare needs of women, children and their families. Our experienced team of over 600 consultants are supported by the latest in diagnostic technology including MRI, CT and interventional radiology scanners. The services include Maternity, Children's Health, Neonatal Medicine, Women's Health and FertilityClinics. We are looking for a Lead Pharmacist who has a passion for working within Paediatrics. You will have good clinical knowledge within the specialism and either already be a Lead or be experienced as a Senior Pharmacist ready for the next step in your career. The Role: EssentialRegistered with GPhCSpecialist pharmacy knowledge and experience in Women and Children's SpecialtiesExtensive Clinical pharmacy practice experience, including some of above specialties:Post graduate diploma/masters in clinical pharmacy or equivalent:Desirable:Previous management experiencePhilips ICIP knowledge: desirableSuccessfully completed an approved course for non–medical prescribers:Registered with the appropriate healthcare regulator as a non-medical prescriber:HCA offers a commitment to maintain the knowledge and competencies of AHP’s and pharmacists by continually investing in training and development by offering a range of mentoring and continuing professional development (CPD) opportunities internally and externally.There will be opportunities to complete fully funded certified courses and qualifications to advance your career in clinical roles as well as leadership and management. Our large network of facilities provide enhanced opportunities for promotion and advancementacross UK sites. What do our teams have to say about us? “Our Pharmacy and Allied Healthcare Professionals are an integral part of our organisation and play a vital role in delivering high quality and exceptional care to our patients. We value our colleagues, proactively supporting them to deliver their potential through structured career and educational frameworks and, inspiring them to be innovative in clinical practice.” Roopa Director of Pharmacy & Medication Safety #LI-HA2"
    }
}