{
	"isSuccess": true,
	"data": {
		"jobsList": [
			{
				"post": "Manufacturing Opportunities",
				"company": "Advanced Healthcare Ltd.",
				"jobDetailsLink": "https://jobsinkent.com/job/2452028",
				"salary": "Competitive salary (based on age and exepreince)",
				"type": "permanent,full-time/part-time",
				"location": "Tonbridge, Kent",
				"description": "Exciting Manufacturing Opportunities Available!Would you like to work in a hands-on practical role?Would you like to be part of a growing international business within the scientific sector?Would you like to receive a competitive salary and benefits package?If the answer to these questions is yes, then please read on!...Centrally located in West Kent, between Tunbridge Wells, Tonbride, Sevenoaks and Edenbridge, AHL has an exciting opportunity for the right candidate to join our busy and friendly manufacturing team.You would be responsible for producing medical device products from the processing, blending and refining of chemical components.The role would suit an active and practically minded person, but also somebody that takes pride in their work and who likes to see their creative efforts rewarded.Some practical skills and basic maths knowledge would be an advantage, but no prior experience is necessary as full vocational training and coaching will be provided.In addition, due to continued growth within our business, there would in time be potential for s"
			},
			{
				"post": "Activity Leader – Clubs Programme/Children’s Activity Leader (Bank)",
				"company": "MORELIFE UK LTD",
				"jobDetailsLink": "https://jobsinkent.com/job/2451578",
				"salary": "Bank role so salary is hourly.",
				"type": "contract,part-time",
				"location": "Medway, Kent",
				"description": "Job title:Activity Leader – Family Clubs Programme (Bank contract)Location:Medway & Swale (Exact location confirmed following interviews)Hours:​Ad hoc hours between 8:30am - 7:30 pm, evening work, weekdays and weekends.Reporting To:Children’s Programme Co-ordinatorKey Relationships:Senior Mangement Team, Senior Practitioners, Coordinators and Practitioners, Administration Staff​The Role:​• Coach parents and children to identify and understand their current barriers to being active.• Inspire the parents and children by facilitating interactive and engaging activity sessions.• Support individuals to set realistic goals in terms of changing behaviour and achieving positive healthy outcomes.​Key responsibilities: -The safe and effective delivery of all Activity sessions during the programme:\nFollowing the Morelife curriculum, plan the sessions to be interactive and engaging, considering the needs of the members in the group.\nFacilitate"
			},
			{
				"post": "Healthy Lifestyle Practitioner - Tier 3",
				"company": "MORELIFEUKLTD",
				"jobDetailsLink": "https://jobsinkent.com/job/2451579",
				"salary": "upto £25,000",
				"type": "contract,full-time",
				"location": "Medway, Kent",
				"description": "Job Title:Specialist Healthy Lifestyle Practitioner – T3 Child Weight ManagementLocation:Medway & Swale – Exact location to be decided following interviewsHours:Permanent - Full time/Part timeReporting To:T3 Clinical service leadKey Relationships: Strategic Children’s Service Manager, T3 clinical Service lead, Children's Healthy Lifestyle Manager, T3 Senior healthlifestyle practitioners, tier 3 service dietitian, tier 3 service family therapist, tier 3 triage nurse. ​​The Role:​The Tier 3 Specialist child weight management service offers a comprehensive multi-disciplinary team approach combining a specialist dietitian, family therapist, specialist nurses, and healthy lifestyle practitioners. The service goal is to support children and their families to achieve moderate and sustainable weight loss using a psychologically informed approach. Support is provided within a group and individual setting over a 12-month period. The service supports children and families with complex social, medical, and educational needs. The post holder wi"
			},
			{
				"post": "Junior Information Analyst Apprentice",
				"company": "Maidstone Borough Council",
				"jobDetailsLink": "https://jobsinkent.com/job/2451798",
				"salary": "National Minimum wage for age",
				"type": "contract,full-time",
				"location": "Maidstone, Kent",
				"description": "Junior Information Analyst ApprenticeSalary: National Minimum wage for age\nLocation: Maidstone, Kent\nContract: 12/18 monthsAbout the RoleWe have an exciting opportunity for an Apprentice to join our Information & Analytics team, working on data-led projects and dashboards. Our team works with all departments across the Council to help them shape their data into meaningful outputs anduseable information. We provide support to the Council by organising key performance indicators, as well as providing research for data to support critical decisions.You will be working in a busy team who put data at heart of what we do. You will be learning how to analyse data, display data to help the reader understand it, as well as research to ensure we have the most up to date data available to us. It is a fast-paced department where we often must adapt to higher priority workload interrupting our project work. We are a central team that supports the organisation to achieve its strategic priorities, which is challenging but rewarding.You will be supported through your training a"
			},
			{
				"post": "Research Assistant",
				"company": "University of Kent",
				"jobDetailsLink": "https://jobsinkent.com/job/2452075",
				"salary": "£28,762 to £33,314 per annum",
				"type": "permanent,full-time",
				"location": "Canterbury, Kent",
				"description": "Research AssistantCentre for Health Services Studies\nLocation:Canterbury\nSalary:£28,762 to £33,314 per annum\nGrade:Grade 6 Research Assistant\nPost Type:Full Time\nContract Type:\tFixed Term - 24 Months\nRelease Date:Tuesday 19 September 2023\nClosing Date:23.59 hours BST on Sunday 22 October 2023(unless otherwise stated)\nReference:LSSJ-267-23-R2This Research Assistantrole represents an exciting opportunity for the successful applicant to join a leading applied health and social care research unit. The post is initially for two years but is renewable depending on future funding. the Centre for Health Services Studies (CHSS) has a wide portfolio of research projects delivered through local, national and international collaborations. Based in the Division of Social Sciences, Law and Journalism the centre is one of three specialist research units with an excellent track record in health and social care research.As a Research Assistant you will :Assist in qualitative and quantitative research including helping to prepare, setup, conduct the research"
			},
			{
				"post": "Senior Lecturer in Medical Education",
				"company": "University of Kent",
				"jobDetailsLink": "https://jobsinkent.com/job/2451636",
				"salary": "£53,353 to £60,027 per annum",
				"type": "permanent,full-time",
				"location": "Canterbury, Kent",
				"description": "Kent and Medway Medical School\nLocation:Canterbury\nSalary:£53,353 to £60,027 per annum\nPlus, where applicable, a Market Supplement, benchmarked to the NHS pay scale appropriate to the successful candidate’s clinical discipline\nGrade:Grade 9\nPost Type:Full Time\nContract Type:\tPermanent\nRelease Date:Tuesday 12 September 2023\nClosing Date:23.59 hours BST on Sunday 01 October 223(unless otherwise stated)\nReference:KMMS-181-23-R2This is your chance to join Kent and Medway Medical School (KMMS) in pioneering a new era of responsive, student-centred medical education.We are seeking an inspirational educator and role model, to deliver high-quality teaching across all years of the School’s undergraduate medicine programme and bring clinical medical insights to the development of the undergraduate programme. It is open to suitably qualified individuals who have a specific interest and background in undergraduate medical, health sciences, healthcare education.We also welcome applications from those with expertise on physiology, pathology, microbiolog"
			},
			{
				"post": "Warehouse Operatives needed",
				"company": "Carlton Recruitment Solutions Ltd",
				"jobDetailsLink": "https://jobsinkent.com/job/2446068",
				"salary": "£23,788.88",
				"type": "permanent,full-time",
				"location": "Sittingbourne, Kent",
				"description": "Our Client is looking for Warehouse Operatives -Days 6am - 6pm 4 days on and 4 days offFull-Time PermanentBenefits:\n•\tBenefits\n•\tFree parking•\t20 days holiday\n•\tPension•\tPPE Provided•\tThey hold staff events and family daysTo ensure all operational processes and stock movements in the warehouse are completed in a safe and timely manner to meet Company and cutomers’ requirements.Key Responsibilities as a Warehouse Operative:•\tGuarantee safe movement and picking of customer product, including safe and correct placement in storage areas\n•\tGuarantee when moving stock with MHE it is safe and has the precise label applied before movement\n•\tMake certain when using MHE that making has the correct fruit to start/finish customer orders on time\n•\tEnsure accurate picking for allocated customers\n•\tEnsure when picking correct SSC labels are applied\n•\tEnsure you follow H+S policies and procedures always\n•\tCorrect PPE to be worn\n•\tWork to loading times so that picked product is delivered to the customer on time\n•\tManage prod"
			},
			{
				"post": "Quality Apprentice",
				"company": "FloPlast Ltd",
				"jobDetailsLink": "https://jobsinkent.com/job/2450634",
				"salary": "£8.19 per hour",
				"type": "permanent,full-time",
				"location": "Sittingbourne, Kent",
				"description": "Established in 1991, FloPlast Ltd is an ever growing, market leader in the manufacture and supply of plastic building and plumbing systems to the UK Construction Sector.We specialise in PVC Roofline, Rainwater, Soil & Waste, Underground Drainage and Hot & Cold Plumbing Systems which we manufacture ourselves and supply directly to Builders and Plumbers Merchants; including B&Q, Screwfix, Selco anTravis Perkins.We have over 300 employees at our Sittingbourne site and pride ourselves in offering career progression and longevity within the business.We are looking to recruit a Quality Apprentice within our Quality Department.This role will assist the Quality Manager in maintaining the Company’s Quality System; learning through a hands on approach with the view of a permanent role within the Quality Department once the apprenticeship is completed.The responsibilities and main duties for this position include but are not limited to the following:\n•\tReporting and investigating incidents\n•\tKeeping internal documentation updated: Processes / Packing specifications et"
			},
			{
				"post": "Railway Operational Standards Specialist",
				"company": "Eurotunnel",
				"jobDetailsLink": "https://jobsinkent.com/job/2451534",
				"salary": "Salary Circa £36K plus attractive benefits package",
				"type": "permanent,full-time",
				"location": "Folkestone, Kent",
				"description": "Railway Operational Standards Specialist in Folkestone (United Kingdom (GB)\nIndefinite (Full-time)Salary Circa £36K plus attractive benefits packageCompleted applications must be received no later than 12 midnight on 28 September 2023.The RoleAn exciting opportunity has arisen at Eurotunnel for a highly skilled and motivated individual to join our System Safety and Railway Stadards Division as a Railway Operational Standards Specialist. You will be responsible for ensuring the integration of Eurotunnel’s Operations Standards against any changes in European and British Rail regulations, to ensure the safety of the Railway system is maintained, and continuously improved.The PersonGained a technical qualification, with proven experience in the operation of a rail transport system. Fluent in English and French, to be able to verbally communicate technical and operational topics, to lead international meetings, and to critically read and write documents.This role will interest you if you are a strong communicator, who enjoys building excellent relatio"
			},
			{
				"post": "Administrator",
				"company": "Improbable",
				"jobDetailsLink": "https://jobsinkent.com/job/2450920",
				"salary": "£29,000 pro rata",
				"type": "permanent,part-time",
				"location": "Edenbridge, Kent",
				"description": "Improbable is recruiting an Administrator. We are looking for a new team member to support the day-to-day delivery of the company and the development of our new home and creation centre, The Gathering, at Bore Place in Kent.We are looking for a new member of our Improbable team, an Administrator. We’re at an exciting moment in the company’s story, we’re remounting shows like My NeighbourTotoro with the RSC and Perfect Show For Rachel with Zoo Co which will be touring next year. We’re running Devoted and Disgruntled, starting new programmes of work like Improbable for Business and importantly developing plans for The Gathering and our new home, Bore Place.We are looking for someone who also enjoys the irregular and responsive nature of working in a small, pretty fast paced and busy team, someone who loves getting stuck in. On any given week you might be pulling together data for the Arts Council, be documenting the rehearsal room, sorting out visas for one of our Artistic Directors, talking to students, taking a pair of stilts across London, running payroll, supportin"
			},
			{
				"post": "Housing Concierge (over 55's)",
				"company": "Clarion Housing Group Ltd",
				"jobDetailsLink": "https://jobsinkent.com/job/2450921",
				"salary": "£25027 - £28910 per annum + Excellent benefits",
				"type": "permanent,full-time",
				"location": "Islington, Greater London",
				"description": "* Salary: £25,027 - £28,910 per annum* Location: London - Cope House* Hours: 36 per week* Contract Type: PermanentWe're looking for someone with good customer care skills to provide a focused management service to our residents living in our Over 55's Housing schemes.You'll be required to manage access to the building for residents, contractors and visitors, and be a key-holdefor the building, ensuring security of the communal areas and facilities.As the first point of contact for our residents, you'll have excellent communication skills, and capable of working with other internal teams to deliver services to residents so they can enjoy their homes and the wider facilities provided.You must be flexible, calm under pressure and able to deal with emergencies. With excellent time management skills you'll be able to organise and prioritise your own workload, whilst delivering excellent services to our customers.You'll preferably have previous experience in Facilities Management and have working knowledge and understanding of the housing/building manageme"
			},
			{
				"post": "Higher Level Teaching Assistant - Numeracy",
				"company": "Leigh Academy Trust",
				"jobDetailsLink": "https://jobsinkent.com/job/2451334",
				"salary": "Actual salary £22,320 per annum (£25,378 full-time equivalent)",
				"type": "permanent,full-time",
				"location": "Swanscombe, Kent",
				"description": "Ebbsfleet Academy has a rare and exciting opportunity to appoint an enthusiastic, motivated and experienced Higher Level Teaching Assistant - Numeracy to join our highly collaborative and supportive team. Our teaching support team is pivotal to our success in the classroom and provides a great deal of support for our teachers, and this position for an HLTA will strengthen the Maths team even furthr with their knowledge, experience and additional support that they can provide our teaching staff with. Our successful candidate will be able to establish strong working relationships with staff and students alike, be able to work as part of a team and will be a reliable and excellent communicator.​​​​​​​Our newly appointed HLTA will be passionate about improving students' learning and development in numeracy and should be proactive, and communicate well with students and teachers alike to ensure that optimum learning takes place within the class. As an academy, we are committed to the professional development of all colleagues. ​​​​​​​This is an excelle"
			},
			{
				"post": "Senior Transport Planner",
				"company": "Stears Haulage Ltd",
				"jobDetailsLink": "https://jobsinkent.com/job/2450872",
				"salary": "33K - 36K dependant on experience",
				"type": "permanent,full-time",
				"location": "Great Stonar, Dover, Kent",
				"description": "Job DescriptionJob Title: Senior Transport PlannerCompany: Stears Haulage Ltd (Est 1971)Reports to: Managing DirectorSalary:£33-36k dependent on experienceLocation: Sandwich, Discovery Park, CT13 9NDStears Haulage Ltd are looking for a strong candidate to join the company to assist a current team of 4 in a busy transport environment.Further opportunities to progress ithe future within the business.Skills and ExperienceMinimum 3- 5 years experience in Transport planning.Managers CPC Qualification advantageous but not essential.Knowledge of drivers hours/working time regulations.The successful candidate will require experience of working in a busy and pressured office environment.The individual would need to have excellent problem-solving skills and be able to adapt to a changing environment and to take responsibility for decisions made at short notice as and when required.Excellent communication skills with an ability to liaise effectively with drivers, customers, work colleagues and members of the public is a requirement. A"
			},
			{
				"post": "People and Volunteer Officer",
				"company": "Kent Wildlife Trust",
				"jobDetailsLink": "https://jobsinkent.com/job/2450620",
				"salary": "Up to £25,000 pa",
				"type": "permanent,full-time",
				"location": "Maidstone, Kent",
				"description": "Globally and nationally wildlife is in steep decline. We appear to be reaching critical tipping points around the loss of biodiversity as well as around climate change, both being interlinked. Human society cannot prosper without wildlife and healthy ecosystems.Kent’s wildlife needs to be restored to much higher levels. We can no longer allow common things to become rare. We can only do ths by restoring large-scale habitat from degraded land. Doing this will contribute to solving global problems. But we won’t be able to do this unless we publicly aspire to a higher level of impact and show that we can deliver this.In this crucial role you will be supporting the People team who strive to create a truly great place to work. We are a flexible employer that aims to be one of the best employers in the environment sector in the southeast and we are looking for someone with the dedication and positivity to help us make this happen.The role will be supporting the People Team in providing an efficient and high quality administrative support service to enable the Trust to r"
			},
			{
				"post": "Neighbourhood Response Manager",
				"company": "Clarion Housing Group Ltd",
				"jobDetailsLink": "https://jobsinkent.com/job/2450910",
				"salary": "£43430 - £51092 per annum + pro rata plus excellent benefits",
				"type": "contract,full-time",
				"location": "Kings Hill, Kent",
				"description": "* Salary: £43,430 - £51,092 per annum pro rata* Location: Hybrid - Kent* Hours: 36 per week* Contract Type: 6 months Fixed Term ContractWe have an exciting opportunity for a Neighbourhood Response Manager to join the housing team in West Malling delivering housing operations services primarily in the Kent area, but with regular involvement with wider regional teams.Managing a rgional Neighbourhood Response Team, you'll be responsible for ensuring that Clarion neighbourhoods are places that residents want to live and that our neighbourhood and estate services are delivered to a high standard meeting the neighbourhood's needs. You'll liaise with other departments to identify and agree priorities for improvements; ensuring the team works collaboratively with other teams, residents groups and external partners.Some of the key accountabilities include -*Ensuring the Neighbourhood Response Team are provided with strong, effective and positive management that establishes a culture which drives performance and delivers high levels of customer satisfaction"
			},
			{
				"post": "Fraud Operations Investigator - Prevention",
				"company": "Vanquis Bank",
				"jobDetailsLink": "https://jobsinkent.com/job/2450613",
				"salary": "£Competitive",
				"type": "permanent,full-time",
				"location": "Chatham, Kent",
				"description": "Vanquis Banking Group has a rich history dating back to 1880. The company was founded in Bradford by Joshua Kelley Waddilove as The Provident Clothing and Supply Company to help people access finance and goods who couldn’t from traditional lenders.Today, Vanquis Banking Group is a FTSE All Share company listed on the London Stock Exchange with around 1.6 million customers and plays the sme role in people’s lives today, as it did when it was founded.Vanquis Banking Group is a unified group made up of two brands: Vanquis (cards and loans) and Moneybarn (vehicle finance). While they offer different products and services, they share the common purpose and customer-centric values at the heart of our group. We understand our customers are real people with varied life experiences, so everything we do from our products to our customer experience is designed with this in mind.You and Your Team:Our dynamic team is dedicated to safeguarding our customers and mitigating financial risks by investigating suspicious transactions and applications. Collaborating wi"
			},
			{
				"post": "Part-time Bookkeeper/Accounts Assistant",
				"company": "Striped Leopard Accountancy Limited",
				"jobDetailsLink": "https://jobsinkent.com/job/2451252",
				"salary": "£28,000 to £30,000 (FTE)",
				"type": "permanent,part-time",
				"location": "Maidstone, Kent",
				"description": "Flexible, remote working 15 hours per week.Friendly and busy accountancy practice based in Maidstone with clients ranging across all industries looking for an experienced and competent bookkeeper.You will be able to take clients records to trial balance and support the accounts team as well as managing your own monthly and quarterly bookkeeping clients.Answering client queries and trining new clients on Xero will also be part of your duties.Essential Skills:In depth Xero experience. You must be confident enough to train clients in the software.\nVAT and CIS experience.\nExcellent communication skills.Bonus Skills:\nPayroll.\nQuickbooks and other bookkeeping software.\nExperience working within an accountancy firm."
			},
			{
				"post": "Housing Scheme Manager for over 55's",
				"company": "Clarion Housing Group Ltd",
				"jobDetailsLink": "https://jobsinkent.com/job/2451612",
				"salary": "£25027 - £28910 per annum + Excellent benefits",
				"type": "permanent,full-time",
				"location": "Morden, Greater London",
				"description": "* Salary: £25,027 - £28,910 per annum* Location: Morden - Apollo House* Hours: 36 hours* Contract Type: PermanentWe're looking for multiple people with good customer care skills to provide a focused management service to our residents living in our Over 55's Housing schemes.You'll be required to manage access to the building for residents, contractors and visitors, and ba key-holder for the building, ensuring security of the communal areas and facilities.As the first point of contact for our residents, you'll have excellent communication skills, and capable of working with other internal teams to deliver services to residents so they can enjoy their homes and the wider facilities provided.You must be flexible, calm under pressure and able to deal with emergencies. With excellent time management skills you'll be able to organise and prioritise your own workload, whilst delivering excellent services to our customers.You'll preferably have previous experience in Facilities Management and have working knowledge and understanding of t"
			},
			{
				"post": "Civil Enforcement Officer",
				"company": "Thanet District Council",
				"jobDetailsLink": "https://jobsinkent.com/job/2451253",
				"salary": "Starting salary of £22,324.32to £25,587.72 inlc shift premium",
				"type": "permanent,full-time",
				"location": "Thanet District Council",
				"description": "Civil Enforcement OfficerLocation: Thanet DistrictPermanent, Full Time posts.\nFlexible and part time hours are also available.What we offer\nStarting salary of £22,324.32to £25,587.72 inlc shift premium, plus market supplement of £240 per monthA rota over a 7-day period, including weekends and bank holidays, between the core hours of 06:00 and 22:00 for full time employees. Eacshift is 8 hours including breaks.Flexible working patterns are also available for zero hour contracts if required.\nAccess to the Local Government Pension Scheme\nEmployee Assistance Programme\nCycle to work scheme\nStaff discount clubWhat we ask\n-Excellent communication skills to deal effectively with the public, contractors, and Police;-Ability to listen, empathise, be assertive and deal with enforcement situations tactfully and diplomatically;-Hardworking and motivated-Must have adequate numeracy, literacy and computer skills to carry out all duties;-Willing and able to work outdoors in varying weather conditions in a solo role or as part of a team (protective clot"
			},
			{
				"post": "Air Conditioning Engineer",
				"company": "The Smart CI Group",
				"jobDetailsLink": "https://jobsinkent.com/job/2452037",
				"salary": "£40,000 dependent upon experience",
				"type": "permanent,full-time/part-time",
				"location": "Sittingbourne, Kent",
				"description": "The Smart CI Group are actively seeking TWO Air Conditioning Engineers for a large increase in demand for projects and maintenance in Kent and the South East.We are a friendly and fast growing provider of commercial industrial services, with a wide variety of customers, offering varied and interesting works.Within the role you will be required to:The Air Conditioning Engineers will beasked with the service, maintenance, install and break downs of Air Conditioning units such as: VRV, VRF, Split, Multi Split, AHU's & Chillers.\nMust have experience installing, maintaining & servicing Air Conditioning units throughout Commercial & high-end Residential properties.Ideally hold an FGAS Certification, a full driving licence and you must have industry experience fault finding, maintaining and servicing Air Conditioning units.We offer:A competitive salary (dependent upon qualifications and experience).\nCompany Vehicle\nCompany Branded Workwear\nOvertime is available, with premium rates at weekend.\nCompany Pension.\n25 days holiday plus all public holidays\nA friendly"
			}
		]
	}
}