{
    "isSuccess": true,
    "data": {
        "post": "Engineering Manager | Globallogic | Bangalore IRC149078 in GlobalLogic",
        "hiringBonus": "10% of monthly salary",
        "views": "581",
        "rating": "3",
        "reviews": "1",
        "companyDescription": "GlobalLogic is a full-lifecycle product development services leader that combines chip-to-cloud software engineering expertise and vertical industry experience to help our customers design, build, and deliver their next-generation products and digital experiences. By leveraging Agile / Lean MVP methods, cutting-edge technologies, and an integrated approach to experience design and complex engineering, we empower global brands such as Microsoft, BMC, Coca Cola, Samsung, Physio Control, and Roku to develop the “next big thing” in their markets. GlobalLogic is headquartered in Silicon Valley and operates design and engineering centers around the world, where we are continuously recognized as a top innovator and employer by organizations like Zinnov and Glassdoor.",
        "recruiter": {
            "name": "GlobalLogic JoinUS",
            "link": "https://jobitt.com/recruiter/2591"
        },
        "jobDescription": "Engineering/delivery Should be good with Engineering Management.Description:Engineering/delivery Should be good with Engineering Management.Handle client communication, escalations, and otherManage customer SCM meetingsPlanning and executionsExperience with Project metrics etcExperienced in AgileRequirements:Should be good with Engineering Management.Handle client communication, escalations, and otherManage customer SCM meetingsPlanning and executionsExperience with Project metrics etcExperienced in Agile Preferences:Program Management Job Responsibilities:Team ManagementFinanceAgile What We OfferExciting Projects: We focus on industries like High-Tech, communication, media, healthcare, retail and telecom. Our customer list is full of fantastic global brands and leaders who love what we build for them.Collaborative Environment: You Can expand your skills by collaborating with a diverse team of highly talented people in an open, laidback environment — or even abroad in one of our global centers or client facilities! Work-Life Balance: GlobalLogic prioritizes work-life balance, which is why we offer flexible work schedules, opportunities to work from home, and paid time off and holidays.Professional Development: Our dedicated Learning & Development team regularly organizes Communication skills training(GL Vantage, Toast Master),Stress Management program, professional certifications, and technical and soft skill trainings.Excellent Benefits: We provide our employees with competitive salaries, family medical insurance, Group Term Life Insurance, Group Personal Accident Insurance, NPS(National Pension Scheme ), Periodic health awareness program, extended maternity leave, annual performance bonuses, and referral bonuses.Fun Perks: We want you to love where you work, which is why we  host sports events, cultural activities, offer food on subsidies rates, Corporate parties. Our vibrant offices also include dedicated GL Zones, rooftop decks and  GL Club where you can drink coffee or tea with your colleagues over a game of table and offer discounts for popular stores and restaurants!About GlobalLogicGlobalLogic is a leader in digital engineering. We help brands across the globe design and build innovative products, platforms, and digital experiences for the modern world.By integrating experience design, complex engineering, and data expertise—we help our clients imagine what’s possible, and accelerate their transition into tomorrow’s digital businesses.Headquartered in Silicon Valley, GlobalLogic operates design studios and engineering centers around the world, extending our deep expertise to customers in the automotive, communications, financial services, healthcare and life sciences, manufacturing, media and entertainment, semiconductor, and technology industries.GlobalLogic is a Hitachi Group Company operating under Hitachi, Ltd. (TSE: 6501) which contributes to a sustainable society with a higher quality of life by driving innovation through data and technology as the Social Innovation Business. ",
        "keywords": "projectmanagement, agilepractices, accountmanager, budgetmanagement",
        "applicationAndResponse": "0 applications 0 responses"
    }
}